{"backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_size": [8, 8], "strides": [4, 4], "filters": 32, "data_format": "channels_last", "activation": "relu", "trainable": true, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "name": "conv2d_1", "bias_constraint": null, "batch_input_shape": [null, 210, 160, 3], "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_size": [4, 4], "strides": [2, 2], "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_2", "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_3", "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "units": 512, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "units": 18, "name": "dense_2", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_1"}, "keras_version": "2.2.4"}